/*
Задача 43 (ДОП, по желанию, на 5 нужно сделать 2 задачки): Напишите программу, которая будет преобразовывать десятичное число в двоичное.
45 -> 101101
3 -> 11
2 -> 10
*/
    
    
    
    Console.Write("Введите число k1: ");
    int num = Convert.ToInt32(Console.ReadLine());
